app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model  =  new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();